# Pandas Module Functions

In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [ ]:
1. DataFrame() function: DataFrame creation
2. concat() function: concatenates pandas objects
3. merge() function: Merge DataFrame or named Series objects
4. join() function:Join columns of another DataFrame
5. multi-index() function

## Dataframe Creation

### DataFrame() function

pd.DataFrame(`data`, `index`, `columns`, `dtype`, `copy`)

In [108]:
pd.DataFrame(randn(2,2), index = [0,1], columns = ["A", "B"])

          A         B
0 -0.162914 -0.040813
1  1.014284 -0.753487

#### from array

In [118]:
pd.DataFrame(np.arange(1,7).reshape(3,2), columns = ["A", "B"])

   A  B
0  1  2
1  3  4
2  5  6

#### new dataframe from existing

In [119]:
df = pd.DataFrame(np.arange(1,7).reshape(3,2), columns = ["A", "B"])
df

   A  B
0  1  2
1  3  4
2  5  6

In [121]:
newdf = df[df["A"]>2]
newdf

   A  B
1  3  4
2  5  6

#### from list

In [123]:
pd.DataFrame([1,2,39,67,90], columns = ["nums"])

   nums
0     1
1     2
2    39
3    67
4    90

### from dictionary

In [10]:
my_dict = {"var1": np.random.randint(10, size=5), "var2":np.random.randint(10, size=5), "var3":np.random.randint(10, size=5)}

In [11]:
pd.DataFrame(data=my_dict)

   var1  var2  var3
0     0     2     5
1     2     9     6
2     2     8     7
3     9     9     1
4     9     9     8

## DataFrame Birleştirme (concat, join, merge)

In [1]:
import pandas as pd
import numpy as np

### concat() function

• Concatenation basically glues dataframes together. 
• Keep in mind that dimensions should match along the axis you are concatenating on. 
• Satır bazlı çalışır. Axis=0
• İki df'i üst üste koyar. Konkat bunun için kullanılır ,inner ve outer ile çok kullanılmaz
• How=inner, kesişim kümesi (satır bazlı çalışır, satırların kesişimine bakar, 0,1-0,2-->0 kesişimini, en azını alır. 0 indekse göre sütunları yerleştirir. 
• How=outer, birleşim kümesi, tüm indeksleri alır, 0,1,2 yi alır sütunları yerleştirir.

• Syntax: pd.concat([df1,df2])

`Docstring`: Concatenate pandas objects along a particular axis with optional set logic along the other axes.

In [55]:
df1 = pd.DataFrame({'A': ['A0', 'A1'],
                        'B': ['B0', 'B1']}, index=[0, 1])

In [60]:
df2 = pd.DataFrame({'A': ['A2', 'A3'],
                        'B': ['B2', 'B3']},
                         index=[2, 3])

In [61]:
df1

    A   B
0  A0  B0
1  A1  B1

In [62]:
df2

    A   B
2  A2  B2
3  A3  B3

In [63]:
pd.concat([df1,df2], axis = 0, join = "outer") # Default: axis: index, 
                                                   # join:outer, means birleşim yani tüm özgün satırları ekler

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [68]:
pd.concat([df1,df2], axis = 0, join = "inner")  # join:inner, kesişim

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [69]:
pd.concat([df1,df2], axis = 1, join = "outer") # Concatenation is done in columns

     A    B    A    B
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2  NaN  NaN   A2   B2
3  NaN  NaN   A3   B3

In [70]:
pd.concat([df1,df2], axis=1)

     A    B    A    B
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2  NaN  NaN   A2   B2
3  NaN  NaN   A3   B3

### Combine two ``Series``.

In [71]:
s1 = pd.Series(["a", "b"])
s2 = pd.Series(["c", "d"])

0    a
1    b
dtype: object

In [73]:
s1

0    a
1    b
dtype: object

In [72]:
s2

0    c
1    d
dtype: object

In [79]:
pd.concat([s1,s2], axis = 0, join = "outer")

0    a
1    b
0    c
1    d
dtype: object

In [80]:
pd.concat([s1,s2], axis = 0, join= "inner")

0    a
1    b
0    c
1    d
dtype: object

In [81]:
pd.concat([s1,s2], axis = 1, join= "outer")

   0  1
0  a  c
1  b  d

In [82]:
pd.concat([s1,s2], axis = 1, join= "inner")

   0  1
0  a  c
1  b  d

## merge() function

`Docstring`: Merge DataFrame or named Series objects with a database-style join.

• merge() function allows to merge dataframes together using a similar logic as merging SQL Tables together.
• Similar to join, merge also combines all the columns from the two tables, with the common columns renamed with the defined suffixes. However merge provides three ways of flexible control over row-wise alignment. 
    ○ 1st way: use on=COLUMN NAME  , here the given column must be the common column in both tables
    ○ 2nd way: is to use left-on=COLUMN NAME and right-on =COLUMN NAME, and it allows to aling the two tables using two different columns
    ○ 3rd way is to use left_index=True and right_index=True, and the two tables are aligned based on their index. 
• İndex veya sütun üzerinde, ortak sütun veya farklı sütunlar üzerinde birleştirmemizi sağlar. 
• Ortak sütun üzerinden birleştirme:
    ○ İnner dersen kesişimini alır(intersection)
    ○ Bir sütundaki ortak değerleri bir araya getiriyor. 
    pd.merge(df11,df12, left_on="lkey", right_on="rkey")
• Ortak sütun değeri yoksa merge yapmanın bir mantığı yok. Konkat yapıp geçersin.

In [90]:
df1

    A   B
0  A0  B0
1  A1  B1

In [91]:
df2

    A   B
2  A2  B2
3  A3  B3

In [92]:
pd.merge(df1, df2, how ="inner", on= None)

Empty DataFrame
Columns: [A, B]
Index: []

In [93]:
left = pd.DataFrame({'key': ['K0', 'K1'],
                     'A': ['A0', 'A1'],
                     'B': ['B0', 'B1']})
   
right = pd.DataFrame({'key': ['K0', 'K1'],
                          'C': ['C0', 'C1'],
                          'D': ['D0', 'D1']})

In [94]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1

In [95]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1

In [96]:
pd.merge(left,right, how="inner", on="key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1

In [97]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1'],
                     'key2': ['K0', 'K1', 'K0'],
                        'A': ['A0', 'A1', 'A2'],
                        'B': ['B0', 'B1', 'B2']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1'],
                               'key2': ['K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2'],
                                  'D': ['D0', 'D1', 'D2']})

In [98]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2

In [99]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2

In [101]:
pd.merge(left, right, how = "inner", on = "key1")

  key1 key2_x   A   B key2_y   C   D
0   K0     K0  A0  B0     K0  C0  D0
1   K0     K1  A1  B1     K0  C0  D0
2   K1     K0  A2  B2     K0  C1  D1
3   K1     K0  A2  B2     K0  C2  D2

In [102]:
pd.merge(left, right, how = "inner", on = ["key1", "key2"])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [103]:
pd.merge(left, right, how="outer", on = ["key1", "key2"])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2

# ortak elemanları olmaya sütunların birleşimi

In [29]:
df111= pd.DataFrame({"lkey": ["x", "y", "z", "x"],
                    "lvalue": [2,3,5,7]})
df121= pd.DataFrame({"rkey": ["a", "b", "c", "b"],
                   "rvalue": [7,8,9,10]})

In [30]:
df111

  lkey  lvalue
0    x       2
1    y       3
2    z       5
3    x       7

In [31]:
df121

  rkey  rvalue
0    a       7
1    b       8
2    c       9
3    b      10

In [32]:
pd.merge(df111, df121, left_on = "lkey", right_on = "rkey")#ortak değer yok. merge fonk anlamsız.

Empty DataFrame
Columns: [lkey, lvalue, rkey, rvalue]
Index: []

In [33]:
pd.merge(df111, df121, how = "outer", left_on = "lkey", right_on = "rkey")

  lkey  lvalue rkey  rvalue
0    x     2.0  NaN     NaN
1    x     7.0  NaN     NaN
2    y     3.0  NaN     NaN
3    z     5.0  NaN     NaN
4  NaN     NaN    a     7.0
5  NaN     NaN    b     8.0
6  NaN     NaN    b    10.0
7  NaN     NaN    c     9.0

In [34]:
pd.merge(df111, df121, how = "left", left_on = "lkey", right_on = "rkey")

  lkey  lvalue rkey  rvalue
0    x       2  NaN     NaN
1    y       3  NaN     NaN
2    z       5  NaN     NaN
3    x       7  NaN     NaN

## join() function

`Docstring`: Join columns of another DataFrame.

In [ ]:
		
		Ø Join function: 
			• convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.
			• Join index üzerine çalışır. Default olarak. 
			• Ortak index üzerinden birleştir: 
				○ left.join(right, how="outer")
				○ Left tablosunun indexlerini esas alır, aynı indexteki sağ tablo satırlarını yanına koyar. 
			• Ortak sütun ismi üzerinde join:
				○  suffix üzerinden birleştirir. 
				○ df.join(other, lsuffix="_df", rsuffix="_other")
			
			• Kontrol imkanının az olduğu fonksiyon
			• İt will combine all the columns from the two tables, with the common columns renamed with the defined lsuffix, rsuffix. 
			• The way is defined by "how":
				○ İnner, outer aynı mantık, default indeksler baz alınır, innerda intersection, outer birleşim kümesi
				○ Left join, sol taraftaki indeksler baz alarak birleştirir. (0,1)ortak olan A sütununu suffix yapıyor. Sonek. 
Right join tersi

In [35]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [36]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [37]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [39]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [40]:
left.join(right, how = "outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

DataFrame Birleştirme (concat, join, merge)• Sum: both join and merge operates on columns and rename the common columns using the given suffix. In terms of row-wise alignment, merge provides more flexibility. 
Different from join and merge, concat can operate on columns or rows, depending on the given axis, and no renaming performed.

# self imposed exercises

# reminder

In [13]:
pd.Series([10,88,3,4,5])

0    10
1    88
2     3
3     4
4     5
dtype: int64

In [20]:
label = ["a","b","c"]
my_data = [10,20,30]
arr = np.array(my_data)
d={"a":10, "b":20, "c":30}

In [21]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [22]:
pd.Series(data=my_data, index= label)

a    10
b    20
c    30
dtype: int64

In [23]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

# exercise go on

In [24]:
s1 = pd.Series(["a","b"])

In [25]:
s1

0    a
1    b
dtype: object

In [26]:
s2= pd.Series(["c","d"])

In [27]:
pd.concat([s1,s2])

0    a
1    b
0    c
1    d
dtype: object

In [28]:
pd.concat([s1,s2], ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object

In [32]:
pd.concat([s1,s2], keys= ["s1","s2"])

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [33]:
pd.concat([s1,s2], keys= ["s1","s2"], names= ["Serie Name", "Row ID"])

Serie Name  Row ID
s1          0         a
            1         b
s2          0         c
            1         d
dtype: object

In [34]:
df1= pd.DataFrame([["a", 1], ["b", 2]], columns = ["letter", "number"])

In [35]:
df1

  letter  number
0      a       1
1      b       2

In [36]:
df2= pd.DataFrame([["c", 3], ["d", 4]], columns = ["letter", "number"])

In [37]:
df2

  letter  number
0      c       3
1      d       4

In [38]:
pd.concat([df1,df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [39]:
df3 = pd.DataFrame([["a", 3, "cat"], ["d", 4, "dog"]], columns = ["letter", "number", "animal"])

In [44]:
df3

  letter  number animal
0      a       3    cat
1      d       4    dog

In [47]:
pd.concat([df1, df3], sort=False)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      a       3    cat
1      d       4    dog

In [50]:
pd.concat([df1, df3], join="inner")

  letter  number
0      a       1
1      b       2
0      a       3
1      d       4

In [51]:
df4= pd.DataFrame([["bird", "polly"], ["monkey", "george"]], columns=["animal", "name"])

In [52]:
df4

   animal    name
0    bird   polly
1  monkey  george

In [53]:
pd.concat([df1,df4], axis =1)

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

# merge

In [124]:
df1 = pd.DataFrame(data = {"lkey": ["foo", "bar", "baz", "foo"], "value": [1,2,3,4]})

In [125]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      4

In [126]:
df2= pd.DataFrame(data= {"rkey": ["foo", "bar", "baz", "foo"], "value": [5,6,7,8]})

In [127]:
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [128]:
df1.merge(df2, left_on="lkey", right_on="rkey")

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        4  foo        5
3  foo        4  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [132]:
pd.merge(df1,df2)

Empty DataFrame
Columns: [lkey, value, rkey]
Index: []

# self devised example

In [91]:
ab = pd.DataFrame({"letters": ["a", "b", "c"],
                 "numbers": [1,2,3]})

In [92]:
ab

  letters  numbers
0       a        1
1       b        2
2       c        3

In [93]:
cd = pd.DataFrame({"letters": ["a", "b", "c"],
                 "numbers": [4,5,6]})

In [94]:
cd

  letters  numbers
0       a        4
1       b        5
2       c        6

In [97]:
pd.merge(ab, cd, on="letters")

  letters  numbers_x  numbers_y
0       a          1          4
1       b          2          5
2       c          3          6

In [154]:
arr1 = np.array([[1,2,3], [4,5,6], [7,8,9], [10,11,12]])

In [155]:
arr1

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [10, 11, 12]])

In [156]:
df1 = pd.DataFrame(data=arr1, columns= ["a", "b", "c"])

In [157]:
df1

    a   b   c
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [158]:
arr2 = np.array([[1,2,3], [4,5,6], [8,8,9], [11,11,12]])

In [159]:
df2 = pd.DataFrame(data=arr2, columns= ["a", "b", "c"])

In [160]:
df2

    a   b   c
0   1   2   3
1   4   5   6
2   8   8   9
3  11  11  12

In [161]:
pd.merge(df1, df2, on="a")

   a  b_x  c_x  b_y  c_y
0  1    2    3    2    3
1  4    5    6    5    6

In [176]:
df = pd.DataFrame({"key": ["K0", "K1", "K2", "K3", "K4", "K5"], 
                  "A": ["A0", "A1", "A2", "A3", "A4", "A5"]})

In [177]:
df

  key   A
0  K0  A0
1  K1  A1
2  K2  A2
3  K3  A3
4  K4  A4
5  K5  A5

In [178]:
other=pd.DataFrame({"key": ["K0", "K1", "K2"],
                   "B": ["B0", "B1", "B2"]})

In [180]:
other

  key   B
0  K0  B0
1  K1  B1
2  K2  B2

In [182]:
df.join(other, how="outer")

ValueError: columns overlap but no suffix specified: Index(['key'], dtype='object')

## MultiIndex() Function

`Docstring`: A multi-level, or hierarchical, index object for pandas objects.

`Type`: type

○ Multi-Index method: it basically take in a list/tuple and create a multi index from it.

In [10]:
outside = ["G1","G1","G1","G2","G2","G2"]
inside = [1,2,3,1,2,3]

In [11]:
hier_index = list(zip(outside, inside)) # zip outside ve inside tuple yapar
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

### Creation of MultiIndex object

In [20]:
hier_index = pd.MultiIndex.from_tuples(hier_index) # MultiIndex bu tuple'ları index hiyerarşisine sokar. 
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [21]:
type(hier_index)

pandas.core.indexes.multi.MultiIndex

### Introducing this MultiIndex object as index argument to the df

In [22]:
df = pd.DataFrame(randn(6,2), index = hier_index, columns = ["A", "B"])
df

             A         B
G1 1  1.349432 -1.470956
   2 -1.899912 -0.082381
   3  0.242107 -0.277123
G2 1 -0.728832 -0.471035
   2 -2.210344 -0.199412
   3  1.579513  1.111629

### Level parameter

We can groupby different levels of a hierarchical index using the `level` parameter:
MultiIndex.from_arrays  : Convert list of arrays to MultiIndex.

In [23]:
mylist = [["Falcon", "Falcon", "Parrot", "Parrot"], ["Captive", "Wild", "Captive", "Wild"]]

In [24]:
mylist

[['Falcon', 'Falcon', 'Parrot', 'Parrot'],
 ['Captive', 'Wild', 'Captive', 'Wild']]

In [25]:
index = pd.MultiIndex.from_arrays(mylist)

In [26]:
index

MultiIndex([('Falcon', 'Captive'),
            ('Falcon',    'Wild'),
            ('Parrot', 'Captive'),
            ('Parrot',    'Wild')],
           )

In [30]:
maxSpeed = {'Max Speed': [390., 350., 30., 20.]}
maxSpeed

{'Max Speed': [390.0, 350.0, 30.0, 20.0]}

In [31]:
df = pd.DataFrame(maxSpeed, index = index)
df

                Max Speed
Falcon Captive      390.0
       Wild         350.0
Parrot Captive       30.0
       Wild          20.0

In [35]:
df.groupby(level = 0).mean()

        Max Speed
Falcon      370.0
Parrot       25.0